InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/Core/NVIC/Header/Peripheral/Register/NVIC_RegisterPeripheral.h
/********************************************************************************************/
/************************************* ICER2 ***********************************************/
/********************************************************************************************/
#define NVIC_ICER2                (((NVIC2_TypeDef*)(NVIC_BASE+NVIC_ICER2_OFFSET)))
#define NVIC_ICER2_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ICER2_OFFSET)))

/********************************************************************************************/
/************************************* ISPR2 ***********************************************/
/********************************************************************************************/
#define NVIC_ISPR2                (((NVIC2_TypeDef*)(NVIC_BASE+NVIC_ISPR2_OFFSET)))
#define NVIC_ISPR2_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ISPR2_OFFSET)))

/********************************************************************************************/
/************************************* ICPR2 ***********************************************/
/********************************************************************************************/
#define NVIC_ICPR2                (((NVIC2_TypeDef*)(NVIC_BASE+NVIC_ICPR2_OFFSET)))
#define NVIC_ICPR2_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ICPR2_OFFSET)))

/********************************************************************************************/
/************************************* IABR2 ***********************************************/
/********************************************************************************************/
#define NVIC_IABR2                (((NVIC2_TypeDef*)(NVIC_BASE+NVIC_IABR2_OFFSET)))
#define NVIC_IABR2_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_IABR2_OFFSET)))

/********************************************************************************************/
/************************************* ISER3 ***********************************************/
/********************************************************************************************/
#define NVIC_ISER3                (((NVIC3_TypeDef*)(NVIC_BASE+NVIC_ISER3_OFFSET)))
#define NVIC_ISER3_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ISER3_OFFSET)))

/********************************************************************************************/
/************************************* ICER3 ***********************************************/
/********************************************************************************************/
#define NVIC_ICER3                (((NVIC3_TypeDef*)(NVIC_BASE+NVIC_ICER3_OFFSET)))
#define NVIC_ICER3_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ICER3_OFFSET)))

/********************************************************************************************/
/************************************* ISPR3 ***********************************************/
/********************************************************************************************/
#define NVIC_ISPR3                (((NVIC3_TypeDef*)(NVIC_BASE+NVIC_ISPR3_OFFSET)))
#define NVIC_ISPR3_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ISPR3_OFFSET)))

/********************************************************************************************/
/************************************* ICPR3 ***********************************************/
/********************************************************************************************/
#define NVIC_ICPR3                (((NVIC3_TypeDef*)(NVIC_BASE+NVIC_ICPR3_OFFSET)))
#define NVIC_ICPR3_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ICPR3_OFFSET)))

/********************************************************************************************/
/************************************* IABR3 ***********************************************/
/********************************************************************************************/
#define NVIC_IABR3                (((NVIC3_TypeDef*)(NVIC_BASE+NVIC_IABR3_OFFSET)))
#define NVIC_IABR3_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_IABR3_OFFSET)))

/********************************************************************************************/
/************************************* ISER4 ***********************************************/
/********************************************************************************************/
#define NVIC_ISER4                (((NVIC4_TypeDef*)(NVIC_BASE+NVIC_ISER4_OFFSET)))
#define NVIC_ISER4_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ISER4_OFFSET)))

/********************************************************************************************/
/************************************* ICER4 ***********************************************/
/********************************************************************************************/
#define NVIC_ICER4                (((NVIC4_TypeDef*)(NVIC_BASE+NVIC_ICER4_OFFSET)))
#define NVIC_ICER4_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ICER4_OFFSET)))

/********************************************************************************************/
/************************************* ISPR4 ***********************************************/
/********************************************************************************************/
#define NVIC_ISPR4                (((NVIC4_TypeDef*)(NVIC_BASE+NVIC_ISPR4_OFFSET)))
#define NVIC_ISPR4_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ISPR4_OFFSET)))

/********************************************************************************************/
/************************************* ICPR4 ***********************************************/
/********************************************************************************************/
#define NVIC_ICPR4                (((NVIC4_TypeDef*)(NVIC_BASE+NVIC_ICPR4_OFFSET)))
#define NVIC_ICPR4_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_ICPR4_OFFSET)))

/********************************************************************************************/
/************************************* IABR4 ***********************************************/
/********************************************************************************************/
#define NVIC_IABR4                (((NVIC4_TypeDef*)(NVIC_BASE+NVIC_IABR4_OFFSET)))
#define NVIC_IABR4_R              (*((volatile uint32_t *)(NVIC_BASE+NVIC_IABR4_OFFSET)))

