InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/Core/NVIC/Header/Peripheral/Register/NVIC_RegisterPeripheral.h
/********************************************************************************************/
/************************************* IPR13 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR13            (((IPR13_TypeDef*)(NVIC_BASE+NVIC_IPR13_OFFSET)))
#define NVIC_IPR13_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR13_OFFSET)))

/********************************************************************************************/
/************************************* IPR14 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR14            (((IPR14_TypeDef*)(NVIC_BASE+NVIC_IPR14_OFFSET)))
#define NVIC_IPR14_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR14_OFFSET)))

/********************************************************************************************/
/************************************* IPR15 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR15            (((IPR15_TypeDef*)(NVIC_BASE+NVIC_IPR15_OFFSET)))
#define NVIC_IPR15_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR15_OFFSET)))

/********************************************************************************************/
/************************************* IPR16 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR16            (((IPR16_TypeDef*)(NVIC_BASE+NVIC_IPR16_OFFSET)))
#define NVIC_IPR16_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR16_OFFSET)))

/********************************************************************************************/
/************************************* IPR17 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR17            (((IPR17_TypeDef*)(NVIC_BASE+NVIC_IPR17_OFFSET)))
#define NVIC_IPR17_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR17_OFFSET)))

/********************************************************************************************/
/************************************* IPR18 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR18            (((IPR18_TypeDef*)(NVIC_BASE+NVIC_IPR18_OFFSET)))
#define NVIC_IPR18_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR18_OFFSET)))

/********************************************************************************************/
/************************************* IPR19 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR19            (((IPR19_TypeDef*)(NVIC_BASE+NVIC_IPR19_OFFSET)))
#define NVIC_IPR19_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR19_OFFSET)))

/********************************************************************************************/
/************************************* IPR20 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR20            (((IPR20_TypeDef*)(NVIC_BASE+NVIC_IPR20_OFFSET)))
#define NVIC_IPR20_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR20_OFFSET)))

/********************************************************************************************/
/************************************* IPR21 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR21            (((IPR21_TypeDef*)(NVIC_BASE+NVIC_IPR21_OFFSET)))
#define NVIC_IPR21_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR21_OFFSET)))

/********************************************************************************************/
/************************************* IPR22 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR22            (((IPR22_TypeDef*)(NVIC_BASE+NVIC_IPR22_OFFSET)))
#define NVIC_IPR22_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR22_OFFSET)))

/********************************************************************************************/
/************************************* IPR23 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR23            (((IPR23_TypeDef*)(NVIC_BASE+NVIC_IPR23_OFFSET)))
#define NVIC_IPR23_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR23_OFFSET)))

/********************************************************************************************/
/************************************* IPR24 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR24            (((IPR24_TypeDef*)(NVIC_BASE+NVIC_IPR24_OFFSET)))
#define NVIC_IPR24_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR24_OFFSET)))

/********************************************************************************************/
/************************************* IPR25 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR25            (((IPR25_TypeDef*)(NVIC_BASE+NVIC_IPR25_OFFSET)))
#define NVIC_IPR25_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR25_OFFSET)))

/********************************************************************************************/
/************************************* IPR26 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR26            (((IPR26_TypeDef*)(NVIC_BASE+NVIC_IPR26_OFFSET)))
#define NVIC_IPR26_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR26_OFFSET)))

