InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/Core/NVIC/Header/Peripheral/Register/NVIC_RegisterPeripheral.h
/********************************************************************************************/
/************************************* IPR27 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR27            (((IPR27_TypeDef*)(NVIC_BASE+NVIC_IPR27_OFFSET)))
#define NVIC_IPR27_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR27_OFFSET)))

/********************************************************************************************/
/************************************* IPR28 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR28            (((IPR28_TypeDef*)(NVIC_BASE+NVIC_IPR28_OFFSET)))
#define NVIC_IPR28_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR28_OFFSET)))

/********************************************************************************************/
/************************************* IPR29 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR29            (((IPR29_TypeDef*)(NVIC_BASE+NVIC_IPR29_OFFSET)))
#define NVIC_IPR29_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR29_OFFSET)))

/********************************************************************************************/
/************************************* IPR30 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR30            (((IPR30_TypeDef*)(NVIC_BASE+NVIC_IPR30_OFFSET)))
#define NVIC_IPR30_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR30_OFFSET)))

/********************************************************************************************/
/************************************* IPR31 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR31            (((IPR31_TypeDef*)(NVIC_BASE+NVIC_IPR31_OFFSET)))
#define NVIC_IPR31_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR31_OFFSET)))

/********************************************************************************************/
/************************************* IPR32 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR32            (((IPR32_TypeDef*)(NVIC_BASE+NVIC_IPR32_OFFSET)))
#define NVIC_IPR32_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR32_OFFSET)))

/********************************************************************************************/
/************************************* IPR33 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR33            (((IPR33_TypeDef*)(NVIC_BASE+NVIC_IPR33_OFFSET)))
#define NVIC_IPR33_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR33_OFFSET)))

/********************************************************************************************/
/************************************* IPR34 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR34            (((IPR34_TypeDef*)(NVIC_BASE+NVIC_IPR34_OFFSET)))
#define NVIC_IPR34_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_IPR34_OFFSET)))

/********************************************************************************************/
/************************************* STIR ***********************************************/
/******************************************************************************************/
#define NVIC_STIR            (((STIR_TypeDef*)(NVIC_BASE+NVIC_STIR_OFFSET)))
#define NVIC_STIR_R          (*((volatile uint32_t *)(NVIC_BASE+NVIC_STIR_OFFSET)))

#endif /* XDRIVER_MCU_DRIVER_HEADER_NVIC_NVIC_PERIPHERAL_NVIC_REGISTER_NVIC_REGISTERPERIPHERAL_H_ */
